# GitHub Команды

# 1. git --help - Показывает список комманд которые ГИТ поддерживает
# 2. git init - Создать новый репозиторий
# 3. git add названиеФайла- добавляет файл в память ГИТа
# 4. git add . - добавляет  все новые обнаруженные файлы
# 5. git rm --cached названиеФайла - elfkztn из памяти файл
# 6. git status - показывает в каком состояние память гита 
# 7. git commit -m "commit text" - ЗАкомитить изменения
# 8. git branch - показывает в какой мы ветке
# 9. git branch названиеВетки - создает новую ветку
# 10. git branch -D названиеВетки - удаление ветки
# 11. git checkout названиеВетки - перейти в другую ветку
# 12. git checkout -b названиеВетки - создание новой ветки и переход в нее 
# 13. git merge readme - обьединение файла из другой ветки с текущей
# 14. git config --global user.name "Новое имя" - задание новое имя разработчика 
# 15. git config --global user.emaill "новый имейл" - задание нового имейла пользователя
# 16. git branch -M main - переименование ветки в ветку поумолчанию github 
# 17. git remote add origin ссылкаСайта привязка удаленного репозитория к локальному
# 18. git push -u origin main - Заливает на GitHub 
# 19. git push -f origin main - Принудительная заливка (опасно, может поломать ветки других разработчиков)
# 20. git push - общая заливка всего что есть
# 21. git clone ссылкаСгита - создание клона проекта для второго разработчика.
# GitHub Комманды